tap "homebrew-zathura/zathura"
tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Simple terminal UI for git commands
brew "lazygit"
# LLVM's OpenMP runtime library
brew "libomp"
# Utility for directing compilation
brew "make"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# High performance message passing library
brew "open-mpi"
# Static type checker for Python
brew "pyright"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# PDF viewer
brew "homebrew-zathura/zathura/zathura", args: ["with-synctex"]
# Comic book plugin for zathura
brew "homebrew-zathura/zathura/zathura-cb"
# DJVU plugin for zathura
brew "homebrew-zathura/zathura/zathura-djvu"
# MuPDF backend plugin for zathura
brew "homebrew-zathura/zathura/zathura-pdf-mupdf"
# Poppler backend plugin for zathura
brew "homebrew-zathura/zathura/zathura-pdf-poppler"
# Postscript backend plugin for zathura
brew "homebrew-zathura/zathura/zathura-ps"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Collect, organise, cite, and share research sources
cask "zotero"
vscode "charliermarsh.ruff"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "rust-lang.rust-analyzer"
vscode "vscodevim.vim"
